Revit 2027 API
PanelScheduleData.BodyShowsVerticalHeaders Property
 Shows text in the Load Summary section's headers vertically instead of horizontally
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BodyShowsVerticalHeaders { get; }
Public ReadOnly Property BodyShowsVerticalHeaders As Boolean
	Get
public:
property bool BodyShowsVerticalHeaders {
	bool get ();
}
member BodyShowsVerticalHeaders : bool with get
Property Value
Boolean
Remarks
 Setting this value must go through the appropriate update function (updateVerticalHeadersInSection)
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace